Table of Contents
 Class SerializableDictionary<TKey, TVal>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
SerializableDictionary
[Serializable]
public class SerializableDictionary<TKey, TVal> : Dictionary<TKey, TVal>, IDictionary<TKey, TVal>, ICollection<KeyValuePair<TKey, TVal>>, IDictionary, ICollection, IReadOnlyDictionary<TKey, TVal>, IReadOnlyCollection<KeyValuePair<TKey, TVal>>, IEnumerable<KeyValuePair<TKey, TVal>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Type Parameters
TKey
TVal
Inheritance
object
Dictionary<TKey, TVal>
SerializableDictionary<TKey, TVal>
Implements
IDictionary<TKey, TVal>
ICollection<KeyValuePair<TKey, TVal>>
IDictionary
ICollection
IReadOnlyDictionary<TKey, TVal>
IReadOnlyCollection<KeyValuePair<TKey, TVal>>
IEnumerable<KeyValuePair<TKey, TVal>>
IEnumerable
IDeserializationCallback
IXmlSerializable
ISerializable
Derived
ConversionDictionary<TKey>
Inherited Members
 Dictionary<TKey, TVal>.Add(TKey, TVal)
 Dictionary<TKey, TVal>.Clear()
 Dictionary<TKey, TVal>.ContainsKey(TKey)
 Dictionary<TKey, TVal>.ContainsValue(TVal)
 Dictionary<TKey, TVal>.GetEnumerator()
 Dictionary<TKey, TVal>.GetObjectData(SerializationInfo, StreamingContext)
 Dictionary<TKey, TVal>.OnDeserialization(object)
 Dictionary<TKey, TVal>.Remove(TKey)
 Dictionary<TKey, TVal>.TryGetValue(TKey, out TVal)
 Dictionary<TKey, TVal>.Comparer
 Dictionary<TKey, TVal>.Count
 Dictionary<TKey, TVal>.Keys
 Dictionary<TKey, TVal>.Values
 Dictionary<TKey, TVal>.this[TKey]
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 SerializableDictionary()
public SerializableDictionary()
 SerializableDictionary(IDictionary<TKey, TVal>)
public SerializableDictionary(IDictionary<TKey, TVal> dictionary)
Parameters
dictionary IDictionary<TKey, TVal>
 SerializableDictionary(IDictionary<TKey, TVal>, IEqualityComparer<TKey>)
public SerializableDictionary(IDictionary<TKey, TVal> dictionary, IEqualityComparer<TKey> comparer)
Parameters
dictionary IDictionary<TKey, TVal>
comparer IEqualityComparer<TKey>
 SerializableDictionary(IEqualityComparer<TKey>)
public SerializableDictionary(IEqualityComparer<TKey> comparer)
Parameters
comparer IEqualityComparer<TKey>
 SerializableDictionary(int)
public SerializableDictionary(int capacity)
Parameters
capacity int
 SerializableDictionary(int, IEqualityComparer<TKey>)
public SerializableDictionary(int capacity, IEqualityComparer<TKey> comparer)
Parameters
capacity int
comparer IEqualityComparer<TKey>
 SerializableDictionary(SerializationInfo, StreamingContext)
protected SerializableDictionary(SerializationInfo info, StreamingContext context)
Parameters
info SerializationInfo
context StreamingContext
Properties
 ValueSerializer
protected XmlSerializer ValueSerializer { get; }
Property Value
XmlSerializer
 Edit this page